app/views/users/show.html.erb

SELECT  1 AS one FROM "sequences" WHERE "sequences"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "sequences".* FROM "sequences" WHERE "sequences"."user_id" = $1 ORDER BY "sequences"."created_at" DESC  [["user_id", 1]]
---
  </section>
  <% if @user.sequences.any? %>