app/controllers/pictures_controller.rb

  def create
    @sequence = Sequence.find(params[:sequence_id])
    @picture = @sequence.pictures.build(picture_params)
    if @picture.save
---
SELECT  "sequences".* FROM "sequences" WHERE "sequences"."id" = $1 ORDER BY "sequences"."created_at" DESC LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "pictures" ("sequence_id", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sequence_id", 3], ["image", "Screen_Shot_2016-12-06_at_12.12.05_PM.png"], ["created_at", 2016-12-08 00:15:26 UTC], ["updated_at", 2016-12-08 00:15:26 UTC]]

  def edit
    @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 ORDER BY "pictures"."created_at" ASC LIMIT $2  [["id", 58], ["LIMIT", 1]]

  def update
    @picture = Picture.find(params[:id])
    if @picture.update(crop_params)
      flash[:success] = "picture successful uploaded"
      redirect_to @picture.sequence
    else
      flash[:warning] = "picture upload failed"
      @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 ORDER BY "pictures"."created_at" ASC LIMIT $2  [["id", 33], ["LIMIT", 1]]
SELECT  "sequences".* FROM "sequences" WHERE "sequences"."id" = $1 ORDER BY "sequences"."created_at" DESC LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def show
    @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 ORDER BY "pictures"."created_at" ASC LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def destroy
    @sequence = @picture.sequence
    @picture.destroy
---
DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 1]]