app/controllers/sequences_controller.rb

INSERT INTO "sequences" ("user_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["created_at", 2016-12-07 23:00:30 UTC], ["updated_at", 2016-12-07 23:00:30 UTC], ["description", "test sequence"]]
---
  def create
    @sequence = current_user.sequences.build(sequence_params)
    if @sequence.save

SELECT  "sequences".* FROM "sequences" WHERE "sequences"."id" = $1 ORDER BY "sequences"."created_at" DESC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @sequence = Sequence.find(params[:id])

DELETE FROM "sequences" WHERE "sequences"."id" = $1  [["id", 3]]
---
  def destroy
    @sequence.destroy