app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "sequences".* FROM "sequences" WHERE "sequences"."user_id" = $1 ORDER BY "sequences"."created_at" DESC  [["user_id", 1]]
---
  def show
    @sequence  = User.find(params[:id]).sequences.build